---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarStyle
source: html/f158584c-2a53-8e60-fb50-afcb4bac0d75.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarStyle Method

Gets the style of the rebar.

## Syntax (C#)
```csharp
public RebarStyle GetRebarStyle()
```

## Returns
Gets the style of the rebar (Standard or StirrupTie).